import { button, title } from "framer-motion/client";

export const LocalText = {
  Header: {
    MenuLinks: {
      ml1: "Отзывы",
      ml2: "Процесс заказа",
      ml3: "Материалы",
      ml4: "О фабрике",
      ml5: "Контакты",
    },
    MenuButton: "Звонок",
    MenuIco: {
      mi1: "Кухни",
      mi2: "Шкафы",
      mi3: "Прихожие",
      mi4: "Гардеробные",
      mi5: "Рабочие зоны",
    },
  },
  Baner: {
    title: "Darina",
    description: "Кухни | Шкафы",
    button1: "Перейти в WhatsApp",
    button2: "Заказать звонок",
  },
  SliderBaner: {
    title: "Добро пожаловать на фабрику Дарина",
    description: "Мебель на заказ стала доступнее",
    altImage1: "Мебель на заказ стала доступнее",
    altImage2: "Мебель на заказ стала доступнее",
    altImage3: "Мебель на заказ стала доступнее",
    altImage4: "Мебель на заказ стала доступнее",
    altImage5: "Мебель на заказ стала доступнее",
  },
  Categoryes: {
    title: "Вдохновления",
    CategoryesLinks: {
      l1: "Кухни",
      l2: "Шкафы",
      l3: "Прихожие",
      l4: "Гардеробные",
      l5: "Рабочие зоны",
    },
  },

  TwoButtonV1: {
    button1: "Рассчитать стоимость",
    button2: "Звонок",
  },
  VideoSlider: {
    title: "",
    title2: "Гарантия 5 лет",
    title3: "Заказ на дому",
    title4: "Современное производство",
    title5: "Качественные материалы и фурнитура",
  },
  ImegBox: {
    button: "Бесплатный дизайн проект",
  },
  IconsBox: {
    title1: "Качественные материалы и фурнитура",
    title2: "Собственное производство",
    title3: "Гарантия 5 лет",
    title4: "Заказ на дому",
    title5: "Доставка по всей России",
    title6: "Бесплатный проект",
    title7: "Срок изготовления от 14 дней",
    title8: "Рассрочка",
    button: "Узнать больше >",
  },
  CommentsModal: {
    title: "Видео отзывы",
    titlePhoto1: "Шкаф в прихожую",
    button: "Смотреть сейчас  +",
    description: "Проконсультируем и с радостью решим ваши вопросы",
  },
  TwoButtonV2: {
    button1: "Рассчитать стоимость",
    button2: "Выезд замерщика",
  },
  footer: {
    title1: "Социальные сети",
    description: "Оплачиваете любым удобным способом",
    email: "darinameb@mail.ru",
    subLogo: "Darina group",
    phoneNumber: "8 (800) 300-85-56",
  },
  Kitchen: {
    bannen: {
      title:
        "До 30 декабря закажите шкаф, или кухню и сэкономите до 10 000 руб на покупку техники у наших партнёров.",
      description: "Заказать выезд дизайнера >",
    },
    sliderBanner: {
      title: "КУХНЯ, КОТОРАЯ УНИКАЛЬНА, КАК И ВЫ!",
      description:
        "Кухня на заказ - возможность совместить функциональность и дизайн со стилистикой вашего дома, раскрыть свою индивидуальность, учесть личные характеристики, черты и привычки. Такая кухня будет отражать именно Вас!",
      description2:
        "Наши лучшие мастера будут рады бесплатно проконсультировать вас и помочь создать проект вашей мечты.",
      titleButton: "Рассчитать стоимость",
    },
    Category: {
      title: "Идеи для вашей кухни на заказ",
      buttonTiTle: "Подробнее",
      titleChange: "СОЗДАЙТЕ СВОЙ СТИЛЬ",
      textDown: "МЫ БУДЕМ РАДЫ ПРОКОНСУЛЬТИРОВАТЬ ВАС",
      TextWhatsAppWhatsApp: "Перейти в WhatsApp",
    },
    KitchenCards: {
      titlePhotoFirstWord: "Любые ",
      titlePhotoSecondWord: "воплощения ваших идей ",
      titleButton: "Бесплатный дизайн проект",
      cardTitle1: "Место, в котором вам понравится жить",
      card1:
        " Кухня - это место, где семьи собираются по утрам и где простой ужин может превратиться в праздник. Кухня является сердцем дома, и мы разрабатываем их в соответствии с вашими личными потребностями",
      cardTitle2: "Как выбрать кухню?",
      card2:
        "Ваши потребности и образ жизни окажут значительное влияние на выбор дизайнерской кухни, которая лучше всего подходит для Вас. Какую технику вы предпочитаете, как часто приглашаете семью и друзей на ужин, какой у вас бюджет? На основе данных вопросов у Вас сформируется список ",
      cardTitle3: "Функциональность на высшем уровне",
      card3:
        "Увеличьте полезное пространство с помощью отсеков и продуманных систем хранения. Каждая деталь будет организована так, чтобы вам было удобно и приятно.",
      cardTitle4: "Эксклюзивный дизайн ",
      card4:
        "Забудьте о стандартных решениях! Вы сами выбираете материалы, цветовые схемы и отделку, создавая уникальную атмосферу, отражающую ваш характер и предпочтения.",
      cardTitle5: "Идеальная планировка",
      card5:
        "Кухня, выполненная под индивидуальные размеры, идеально подходит именно для вашего пространства. Вам больше не нужно жертвовать удобством ради стиля — каждое движение будет естественным и свободным.",
      textUnder1:
        "Выберите кухню на заказ и погружайтесь в мир вдохновения и гармонии!",
      textUnder2: "Заказать мебель стало проще",
    },
  },
  shkaf: {
    sliderBanner: {
      title: "Шкаф вашей мечты",
      des: "Наши шкафы сочетают в себе красоту и функциональность, чтобы идеально соответствовать Вашим потребностям, желаниям и образу жизни",
      des2: "Наши лучшие мастера будут рады бесплатно проконсультировать вас и помочь создать проект вашей мечты",
      textButton: "Рассчитать стоимость",
    },
    Gategory: {
      title: "Идеи для вашего шкафа на заказ",
    },
    shkafVideoButton: {
      titleSpan1: "Встроенный шкаф -",
      titleSpan2: "скрытый порядок",
      titleTextComponent: "Гармония с пространством.",
      desTextComponent:
        "Шкаф, изготовленный по индивидуальным размерам, прекрасно вписывается даже в самые нестандартные уголки вашего дома. Вы можете использовать все пространство, от стены до стены, от пола до потолка",
      titleButtonTextComponent: "Рассчитать стоимость",
    },
    Perfectlayout: {
      title: "Идеальная планировка",
      titleTextComponent: "Эксклюзивность и уникальность. ",
      desTextComponent:
        "Воплотим любые решения, учитывая все потребности. Вы можете выбрать дизайн, материалы и детали, которые подходят именно вам. Каждый шкаф - выражение вашего вкуса. ",
    },
    TopLevel: {
      title: "Функциональность на высшем уровне",
      des1: "Оптимизация функциональности. ",
      des2: "Шкаф на заказ позволяет создать идеальные внутренние решения, от выдвижных систем до специализированных отсеков. ",
      buttonTiTle1: "Перейти в WhatsApp",
      buttonTiTle2: "Заказать звонок",
      buttonTiTle3: "Выезд замерщика",
    },
    CustomCabinet: {
      title: "шкаф на заказ",
      des: "Красивый и функциональный мир, где ваша душа расцветает",
      titleButton: "Перейти в WhatsApp",
    },
    EmotionalConnection: {
      title: "",
      titleTextComponent: "Эмоциональная связь.",
      desTextComponent:
        "Процесс создания шкафа — это возможность воплотить все ваши желания и мечты.Он станет не просто мебелью, а частью вашего стиля и истории.",
    },
  },
  Prikhozhie: {
    PrikhozhieTextBov: {
      title: "Добро пожаловать домой!",
      des1: "Мы создадим шкаф по индивидуальным размерам, который идеально впишется в вашу прихожую. Вы сможете выбрать размер, цвет, материал, фурнитуру и другие детали, которые сделают шкаф уникальным.",
      des2: "Наши лучшие мастера будут рады бесплатно проконсультировать  вас и помочь создать проект вашей мечты.",
      titleButton: "Рассчитать стоимость",
    },
  },
};
